# -*- coding: utf-8 -*-
def add_rest(d, B, valiya):
    d["REFINERIES"] = [
        ("ജാംനഗർ റിഫൈനറി", "റിലയൻസ്"), ("ജാംനഗർ റിഫൈനറി", f"ഏറ്റവും {valiya}"),
        ("പണിപ്പൂർ റിഫൈനറി", "IOCL"), ("പണിപ്പൂർ റിഫൈനറി", "ഹരിയാന"),
        ("കൊച്ചി റിഫൈനറി", "BPCL"), ("കൊച്ചി റിഫൈനറി", "കേരളം"),
        ("വഡിനാർ റിഫൈനറി", "Nayara Energy"), ("വഡിനാർ റിഫൈനറി", "ഗുജറാത്ത്"),
        ("ഡിഗ്ബോയ് റിഫൈനറി", "ആദ്യ റിഫൈനറി"), ("ഡിഗ്ബോയ് റിഫൈനറി", "അസാം"),
        ("നുമാലിഗarh റിഫൈനറി", "NRL"), ("നുമാലിഗarh റിഫൈനറി", "അസാം"),
        ("പാരദീപ് റിഫൈനറി", "IOCL"), ("പാരദീപ് റിഫൈനറി", "ഒഡിഷ"),
        ("ബറൗണി റിഫൈനറി", "IOCL"), ("ബറൗണി റിഫൈനറി", "ബിഹാർ"),
        ("ഹാൽദിയ റിഫൈനറി", "IOC"), ("ഹാൽദിയ റിഫൈനറി", "പശ്ചിമബംഗാൾ"),
        ("മാംഗalore റിഫൈനറി", "MRPL"), ("മാംഗalore റിഫൈനറി", "കർണാടക"),
        ("വിശാഖ റിഫൈനറി", "HPCL"), ("വിശാഖ റിഫൈനറി", "ആന്ധ്ര"),
        ("മഥുര റിഫൈനറി", "IOCL"), ("മഥുര റിഫൈനറി", "ഉത്തർപ്രദേശ്"),
        ("പanipat റിഫൈനറി", "IOCL"), ("പanipat റിഫൈനറി", "ഹരിയാന"),
        ("തatiപaka റിഫൈനറി", "ONGC"), ("തatiപaka റിഫൈനറി", "ആന്ധ്ര"),
        ("ബina റിഫൈനറി", "BPCL"), ("ബina റിഫൈനറി", "മധ്യപ്രദേശ്"),
    ]
