
    d["KERALA_UNIV_HQ"] = [
        ("കേരള സർവകലാശാല", "തിരുവനന്തപുരം"),
        ("കാലിക്കറ്റ് സർവകലാശാല", "തേഞ്ഞിപ്പലം"),
        ("മഹാത്മാ ഗാന്ധി സർവകലാശാല", "കോട്ടയം"),
        ("കണ്ണൂർ സർവകലാശാല", "കണ്ണൂർ"),
        ("കൊച്ചിൻ സience & technology university", "കൊച്ചി"),
        ("കerala agricultural university", "വെള്ളാനിക്കര"),
        ("കerala veterinary and animal sciences university", "പൂക്കോട്"),
        ("ശ്രീ ശങ്കരാചാര്യ സംസ്കൃത സർവകലാശാല", "കാലടി"),
        ("എ.പി.ജെ. അബ്ദുൽ കലാം സാങ്കേതിക സർവകലാശാല", "തിരുവനന്തപുരം"),
        ("കerala university of fisheries and ocean studies", "പനങ്ങാട്"),
        ("നാഷണൽ യൂണിവേഴ്സിറ്റി ഓഫ് അഡ്വാൻസ്ഡ് ലീഗൽ സ്റ്റഡീസ്", "കൊച്ചി"),
        ("കerala university of health sciences", "തൃശ്ശൂർ"),
        ("കേന്ദ്ര സർവകലാശാല കേരളം", "കാസർഗോഡ്"),
    ]
